{"pages":[],"posts":[{"title":"How to create your own hexo blog -- (learning note)","text":"This is a tutorial for those who what to create their own Blog using Hexo based on Mac OS from scratch.There are 4 parts including installing, creating hexo config, deploying to remote, and changing themes.Without further do, let’s start!!! Quick StartInstalling Before installing Hexo, we should install Node.js first. To check whether you have installed Node.js properly, open Terminal and input following code. 1$ node -v You need to check npm also. 1$ npm -v Install Hexo config. 1$ npm install -g hexo-cli Then checking whether hexo was installed properly. 1$ hexo -v Until now, we have finished the first step: installing. Creating blog config Build a blog folder. Note: you can delete the folder directly if you don’t want the blog any more. 1$ mkdir blog Initialize 123$ cd blog$ hexo init$ hexo s Until now, the hexo config has done, we can open the local address to go through it. now, let’s start a new post. 1$ hexo n 'my first blog' you can edit the post using Visual Studio Code under the folder ‘source’ of blog, or using vim under terminal as follows. 1$ vim my-first-blog.md Deploying to Remote Deploy to github: create a new repository on github. NOTE: the name of the ropos must be same with your username Installing a config under the blog folder.1$ npm install --save hexo-deplyer-git Setup ‘_config.yml’ file.12$ vim _config.yml$ i Scrolling to the bottom to find ‘deployment’, and add 3 lines as following: type: gitrepo: ’TheNewCreatedGitRepo’branch: master ***Note: there should keep one space after : ***Then, press ’esc’ and input :wq for save and quit vim. Deploy to remote that is github.1$ hexo d Changing the theme Download the theme from github, or search online and install it as their instructions.1$ git clone https://github.com/litten/hexo-theme-yilia.git themes/yilia Application the theme12$ vim _config.yml$ i modify ‘landscape’ to ‘yilia’ at the theme of ‘extensions‘ Generate, start, and deploy it.1234$ hexo clean$ hexo g$ hexo s$ hexo d Finally, a personal blog website was done. I will go further into the themes configuring, including Logo, paging, navigation bar and so on. Reference: (https://www.youtube.com/watch?v=erKYtw4Rfhk&amp;t=790s)","link":"/2021/01/22/hello-world/"},{"title":"My first Blog","text":"","link":"/2021/03/19/My-first-Blog/"},{"title":"my first blog","text":"First Chaptercontent Second Chaptercontent Referencewww.google.com","link":"/2021/03/22/my-first-blog-0/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"}],"categories":[]}